# import libraries
import streamlit as st
from PIL import  Image
import matplotlib as plt
import pandas as pd

# Inject CSS for RTL
rtl_css = """
<style>
body {
    direction: rtl;
    text-align: right;
}
</style>
"""
st.markdown(rtl_css, unsafe_allow_html=True)

# Load data
df = pd.read_csv('Final_version4_all_watches.csv')

# Title
st.title('ساعتك مو للزينة بس تقدر تستثمر فيها، خلها زينة وخزينة!')


st.markdown("""
في الوقت الحالي، الساعات الفاخرة ما صارت مجرد أداة نعرف فيها الوقت لكنها صارت استثمار ذكي يحتفظ بقيمته ويزيد مع الوقت، مثل الذهب والعقارات.
الكثير صاروا يشوفونها كأصول ثمينة، خاصة إذا كانت نادرة أو من ماركات عالمية معروفة، وهذا يخليها خيار مثالي لأي شخص يفكر في الاستثمار.
إذا كنت ناوي تدخل هذا المجال، أهم شيء أنك تركز على فهم السوق، تعرف الموديلات النادرة اللي عليها طلب، وتتابع الماركات اللي تحافظ على قيمتها أو تزيد. 
**وهنا يجي دورنا،** لأننا درسنا لك السوق بعناية وراح نوفر لك أهم التفاصيل والجوانب اللي تحتاج تعرفها، عشان تدخل هذا العالم بثقة وتحقق أفضل النتائج.
""")


st.markdown("""
في البداية، بنعرض توزيع أسعار الساعات لأفضل عشر ماركات فاخرة عشان تعرف كيف تختلف الأسعار حسب الماركة بشكل عام. 
""")

# Filter data based on condition
condition = st.selectbox('اختر حالة الساعة', df['condition'].unique())
filtered_df = df[df['condition'] == condition]

# Calculate average prices for top 10 brands
top_brands = filtered_df.groupby('brand')['price_usd'].median().sort_values(ascending=False).head(10)

# Plot the data
st.bar_chart(top_brands)


st.markdown("""
هنا بنوضح في أي سنوات كانت الساعات غالية أكثر. راح نعرف إذا كانت فيه سنوات صنع معينة زادت فيها الأسعار، ويمكن تكون بسبب تقنيات جديدة أو إصدارات خاصة. """)


st.markdown("""
اضف الشارت سنوات التصنيع اللي فيها أعلى الأسعار
""")




st.markdown("""
الان بنشوف كيف يختلف متوسط أسعار الساعات بين الرجال والنساء. هذا الرسم البياني بيساعدك تعرف إذا كان فيه فرق كبير في الأسعار حسب الجنس. """)


st.markdown("""
اضف الشارت متوسط الأسعار حسب الجنس
""")




st.markdown("""
بنقسم الساعات حسب الجنس ونعرض متوسط الأسعار للساعات بناءً على سنوات التصنيع.
            بنقسمها لفترات كل ثلاث سنوات (مثلاً: 2010-2013، 2014-2017، 2018-2021) عشان نعرف كيف تغيرت الأسعار عبر السنين.
            """)

st.markdown("""
اضف الشارت متوسط الأسعار حسب الجنس وسنوات التصنيع
""")




st.markdown("""
هنا بنشوف كيف يؤثر جنس المستخدم على سعر الساعة حسب مادة السوار (مثلاً: جلد، معدن، سيراميك). هذا الرسم البياني بيوضح إذا بعض المواد غالية أكثر حسب الجنس.""")

st.markdown("""
اضف الشارت متوسط الأسعار حسب الجنس ونوع مادة السوار
""")




st.markdown("""
 بنركز على تأثير نوع مادة الساعة (مثل الفولاذ، الذهب، التيتانيوم) على متوسط الأسعار حسب الجنس. هذا يساعدنا نعرف إذا الماركات أو المواد الغالية تختلف بين الرجال والنساء.""")


st.markdown("""
اضف الشارت متوسط الأسعار حسب الجنس ونوع مادة الساعة
""")



st.markdown("""
بنختم بنقطة مهمة وتعتبر من اهم الجوانب الي لازم تعرفها وهي كيف حالة الساعة واستخدامها (جديدة، مستعملة، أو مجددة) 
            وتأثر على السعر. هنا بنعرف إذا الساعات الجديدة أغلى أو إذا الساعات المستعملة لها قيمة.
            """)

st.markdown("""
اضف الشارت متوسط الأسعار حسب حالة الساعة واستخدامها
""")


st.markdown("""
في الأخير بنعطيك اهم التوصيات الي وصلنا لها لو حاب تدخل في الاستثمار بالساعات الفاخرة
-  النقطه الاولى
- النقطه الثانيه
- النقطه الثالثة
-  النقطه الرابعه
""")


 


st.markdown("""
جزئية الويبسايت و اليوزر انبوت 
""")